01-ahmed-body/cases/slant35_re4.18M_symtest_transient/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 35deg TRANSIENT case, level (4 5), matching 0deg/10deg/20deg/25deg
// (user decision B; 30deg was kept at (5 6)). Only `level` differs from
// the 35deg steady dictionary. nCellsBetweenLevels starts at 3 and is
// TESTED, not assumed: at 0/10/20deg this level oscillated in shell
// refinement at 3 and was fixed by 2. To be changed to 2 only if the
// oscillation recurs here.
//
// resolveFeatureAngle 120 (option C, user decision): matches 25/30deg.
// On the steady 35deg mesh it marked 0 cells under curvature/regions in
// every pass, as predicted in advance from the slant-to-rear edge
// (first selected between 124 and 125deg includedAngle, ~55-56deg
// normal-angle difference, below the 120deg threshold).
castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    ahmedBody
    {
        type triSurfaceMesh;
        file "ahmedBody.stl";
    }

    wakeRefinementBox
    {
        type searchableBox;
        min (1.044  0.00 0.0);
        max (4.176  0.35 0.7);
    }
}

castellatedMeshControls
{
    maxLocalCells       200000;
    maxGlobalCells      6000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    features
    (
    );

    refinementSurfaces
    {
        ahmedBody
        {
            level (4 5);
        }
    }

    resolveFeatureAngle 120;

    refinementRegions
    {
        wakeRefinementBox
        {
            mode    inside;
            levels  ((1e15 3));
        }
    }

    insidePoint (-1.5 0.5 1.0);

    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       4.0;
    nSolveIter      30;
    nRelaxIter      5;
    nFeatureSnapIter 10;
}

addLayersControls
{
    relativeSizes   false;

    layers
    {
    }
}

meshQualityControls
{
    maxNonOrtho             65;
    maxBoundarySkewness     20;
    maxInternalSkewness     4;
    maxConcave              80;
    minFlatness             0.5;
    minVol                  -1e30;
    minTetQuality           1e-30;
    minTwist                0.02;
    minDeterminant          0.001;
    minFaceWeight           0.02;
    minVolRatio             0.01;
    nSmoothScale            4;
    errorReduction          0.75;
}

mergeTolerance 1e-6;

// ************************************************************************* //
